#Generated by Fabric Compiler ( version 2022.2-SP6.4 <build 146967> ) at Thu Nov  6 14:39:07 2025

set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "C:/Users/LENOVO/Desktop/backup3/source/uart_test.v"
add_design "C:/Users/LENOVO/Desktop/backup3/source/uart_tx.v"
add_design "C:/Users/LENOVO/Desktop/backup3/source/uart_drive.v"
add_design C:/Users/LENOVO/Desktop/backup3/ipcore/wnr_fifo/wnr_fifo.idf
add_design "C:/Users/LENOVO/Desktop/backup3/source/fsm.v"
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
add_design "C:/Users/lilpheonix/Downloads/SpectrumAnalyzer/source/source/meter.v"
add_design "C:/Users/lilpheonix/Downloads/SpectrumAnalyzer/source/source/serial_port_rx.v"
add_design "C:/Users/lilpheonix/Downloads/SpectrumAnalyzer/source/source/sqrt.v"
add_design "C:/Users/lilpheonix/Downloads/SpectrumAnalyzer/source/source/interface.v"
add_design "C:/Users/lilpheonix/Downloads/SpectrumAnalyzer/source/source/div64.v"
add_design "C:/Users/lilpheonix/Downloads/SpectrumAnalyzer/source/SpectrumAnalyzer/source/fft_top.v"
remove_design -force -verilog "C:/Users/lilpheonix/Downloads/SpectrumAnalyzer/serial_port_rx.v"
remove_design -force -verilog "C:/Users/lilpheonix/Downloads/SpectrumAnalyzer/source/17_fft_HDMI/source/sqrt.v"
remove_design -force -verilog "C:/Users/lilpheonix/Downloads/SpectrumAnalyzer/interface.v"
remove_design -force -verilog "C:/Users/lilpheonix/Downloads/SpectrumAnalyzer/rms_referee/rms_referee/source/meter.v"
remove_design -force -verilog "C:/Users/lilpheonix/Downloads/SpectrumAnalyzer/rms_referee/rms_referee/source/div64.v"
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
remove_design -force -verilog "C:/Users/lilpheonix/Downloads/SpectrumAnalyzer/source/SpectrumAnalyzer/source/fft_top.v"
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
